package hiw.saad.com.howiwork.Adapters;

import android.content.Context;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseExpandableListAdapter;
import android.widget.TextView;

import hiw.saad.com.howiwork.R;

public class DetailsAdapter extends BaseExpandableListAdapter {

	private final Context mContext;
	private final LayoutInflater mLayoutInflater;

	private final String[] mGroups = {
			"নাম ও পেশা",
			"আপনি তো এসডি এশিয়ার প্রতিষ্ঠাতা, এসডি এশিয়া এর মূল লক্ষ্য আমাদের সাথে শেয়ার করবেন কি?",
			"আপনি অনেক কিছুর সাথে যুক্ত আছেন যেমন ZuumZuum, WAVE, GO! Traffic, Light Castle Partners সব কিছু একসাথে আপনি মেনেজ করেন কিভাবে?",
			"আপনি তো একজন ইনভেস্টরও, কোন আইডিয়া তে ইনভেস্ট করতে হলে কি কি জিনিস মাথায় রেখে ইনভেস্ট করেন?",
			"আপনাকে যদি জিজ্ঞাসা করা হয় নিজেকে পরিচয় দিতে, তাহলে কিভাবে পছন্দ করবেন নিজেকে পরিচয় দিতে একজন ইনভেস্টর নাকি ব্যবসায়ী নাকি একজন উদ্যোক্তাতা এবং কেন?",
			"কোন বিষয়টি আপনার কোম্পানীকে বিশেষত্ব দান করেছে?",
			"আপনার কোম্পানীর ইতিহাসে আপনার সবচেয়ে সুখের মুহুর্ত কি ছিল?",
			"আপনার কি কোন ব্যবসায়িক দর্শন আছে?",
			"আপনার ব্যবসার সবচেয়ে গুরুত্বপূর্ণ অনুশীলন কি ?",
			"কোনটি আপনার সফলতার জন্য একটি গুরুত্বপূর্ণ কারন?",
			"আপনি সম্প্রতি একটি কোম্পানী শুরু করেছেন, এটা কি সম্পর্কিত?",
			"যে ডিভাইসগুলো দিয়ে সবচেয়ে বেশি কাজ করেন এবং কেন?",
			"তিনটি অ্যাপ/সফটওয়ার/টুলস যেটি ছাড়া আপনার একদিনও চলা সম্ভব না?,",
			"আপনার কাজের স্থানটা কেমন?",
			"যখন কাজ করেন তখন কি ধরনের গান শোনেন?",
			"একজন বাংলাদেশি হিসেবে যানজট আমাদের নিত্য দিনের সঙ্গী। আপনি যখন যানজটে অলস বসে থাকেন তখন কি করেন ?," ,
					"আপনার মোবাইল এবং কম্পিউটার ছাড়া এমন কি ডিভাইস ব্যাবহার করেন যেটা ছাড়া আপনি থাকতে পারবেন না?",
			"আপনি কোন সময়টাতে কাজ করতে সবচেয়ে বেশি পছন্দ করেন ?",
			"আপনার ঘুমানোর রুটিন কি রকম?",
			"আপনার জীবনে আপনি সবচেয়ে ভাল উপদেশ কি পেয়েছেন?",
			"যেকোনো জটিল পরিস্থিতিতে নিজের কাজ করার মানসিকতা ঠিক রাখার জন্য আপনি কি করেন ?," ,
					"অন্যান্য সব বিষয় খেয়াল রেখে আপনার ব্যবসা সঠিক ভাবে পরিচালনা করেন কিভাবে?",
			"জীবিত অথবা মৃত, আপনি যে কয়েকজন উদ্যোক্তাকে সম্মান করেন তারা কারা?",
			"একজন উদ্যোক্তা হিসেবে পরবর্তী ৫ বছরে আপনি কি অর্জন করতে চান,?",
			"আপনি ভবিষ্য\u09CE উদ্যোক্তাদের জন্য আর কিছু যুক্ত করতে চান?",
			"শূন্যস্থান পূরণ করুন। আমি অনেক খুশি হব এই প্রশ্নগুলো _____________ জিজ্ঞেস করতে।"


	};


	private final String[][] mChilds = {
			{"মুস্তাফিযুর রাহমান খান, Startup Dhaka এর প্রতিষ্ঠাতা এবং সিইও।"},
			{"এসডি এশিয়ার মূল লক্ষ্য হলো একটি রিজিওনাল ব্র্যান্ড তৈরী করা যেটি শুধু উদ্যোক্তার গল্পগুলো তুলে ধরবেনা বরং পাশাপাশি রিজিওনাল  স্টার্টআপ কমিউনিটি গুলোকে ঐক্যবধ্য করবে। আমাদের স্থানীয় সাফল্যের গল্পগুলো দ্বারা আমরা আন্তর্জাতিক ভিসি এবং বিনিয়োগকারীদের আকর্ষণ করতে ও আমাদের সমূহের সংলাপ গুলোকে অর্থবোধক করে তুলে ধরতে সাহায্য করবো। ইতিমধ্যে আমরা কিছু বড় অনলাইন ব্র্যান্ড এর সাথে যোগাযোগ করেছি কিন্তু আমাদের বৃদ্ধির সাথে আমরা আমাদের নেটওয়ার্কটিও বড় করতে চাই। উদাহরণ হিসেবে বলা যায় যে, আমরা ২০১৫ তে e27 এর সাথে এশিয়ার বৃহত্তম স্টার্টআপ  ইভেন্টে অংশ নিয়েছি এবং বাংলাদেশে প্রথমবারের মত স্থানীয় বাছাইকরণ ইভেন্টের আয়োজন করেছি। কিছুদিন আগে আমরা Tech in Asia এর টোকিও ইভেন্ট প্রোমোট করতে তাদের সাথে অংশগ্রহণ করেছি। গত বছর আমরা ভারত থেকে আসা Your Story, ভিয়েতনাম থেকে আসা TechFest এবং নিউ ইয়র্ক থেকে আসা AlleyWatch এর সাথে অংশগ্রহণ করেছি।"},
			{"আমরা হচ্ছি ভেনচার বিল্ডারস, যেটা প্রকৃত বিনিয়োগের চেয়ে কিছুটা আলাদা। এর মানে আমরা শুধু কোম্পানীতে বিনিয়োগই করিনা বরং তাদের উন্নতিতেও সাহায্য করি। আমরা তাদের কাজে সহায়তা করি, তাদের কঠিন বিজনেস সমস্যাগুলো সমাধান করতে সাহায্য করি এবং তাদের ব্যবসাকে উন্নীত করতে একসাথে কাজ করি। সাধারণত ব্যবসায়ের এই মোড় নেয়া গুলো প্রথম ৬ মাসেই বোঝা যায়, আর তা ব্যবসায়ের বৃদ্ধির সাথে বাড়তে থাকে। অতঃপর এসব স্টার্টআপ এর প্রতিষ্ঠাতারা তাদের বড় সিদ্ধান্তগুলোর সাথে আমাদের জড়িয়ে নেয়। আমরা “ওয়ার্কিং অ্যাট আর্মস লেঙ্ঘথ” এবং “হ্যান্ডস হোল্ডিং” দুই উপায়ে কাজ করলেও দ্বিতীয়টির বেশি কার্যকারিতা পেয়েছি। এসকল ব্যাপারগুলো থেকে বোঝা যায় যে টিম গুলোকে কার্যকরী ভাবে ম্যানেজ করতে হলে আমাদেরকে সময় সম্পর্কে আরো স্মার্ট হতে হবে।"},
			{"আমি খুব সাধারণ একটা নিয়ম অনুসরণ করি, যে আইডিয়াতে নয় বরং টিম এর উপর ইনভেস্ট করা। দিনশেষে যদি টিম কোন আইডিয়া কে কাজ করাতে না সক্ষম হয় তাহলে সব  আইডিয়াই বাজে আইডিয়া। তারপরও পাঠকদের স্বার্থে স্টার্টআপ বিনিয়োগের ব্যাপারে আমি তিনটি নিয়ম বলতে পারিঃ\n" +
					"\n" +
					"টিমটি কাদের নিয়ে গঠিত এবং তাদের মার্কেট জয় করার মত কি কি দক্ষতা আছে?\n" +
					"আইডিয়াটি কোন ক্যাটাগরীতে পরে এবং সেটার চাহিদা কেমন? চাহিদা কি খুব দ্রুত স্কেল করা যাবে কিনা?\n" +
					"বিজনেসটির কি কোন একক প্রযুক্তি আছে কিনা যা প্রতিযোগীতায় সাহায্য করবে?"},
			{"আমি সাধারণত বলে থাকি যে আমি একজন ভেনচার বিল্ডার, স্টার্টআপ কমিউনিটি অর্গানাইজার এবং একজন মার্কেটার কারণ এগুলোর সবগুলোই আমার পরিচয়েরই অংশ। বিগত ১৮ বছর ধরে আমি অনেক কিছু হিসেবে কাজ করেছি এবং আজ এইসবগুলো পরিচয় মিলেই আমাকে এককভাবে পরিচিত করেছে।"},
			{"বাংলাদেশের উদ্যোক্তা এবং বিনিয়োগকারীদের সাহায্য করে এরকম উপাদান তৈরি নিয়েই আমাদের কাজ। আমরা এখানে নিয়মিত প্রযুক্তি বিষয়ক সম্মেলন এবং বড় পরিসরের স্টার্টআপ ইভেন্ট আয়োজন করে আসছি। আমরা আমাদের সীমানা পেরিয়ে বৃহ\u09CE পরিসরের প্রযুক্তি ও স্টার্টআপ ইকোসিস্টেম এর সাথে সংযুক্ত হয়েছি। আমরা মনে করি যে, দেশ-বিদেশের বিভিন্ন মানুষ আমাদের পরিসরে কাজ করবে এরকম বিশ্বাসযোগ্যতা আমরা আমাদের কাজের মাধ্যমে অর্জন করতে পেরেছি।"},
			{"যেকোন প্রতিষ্ঠান ই বিভিন্ন রকমের কঠিন এবং চমকপ্রদ সময়ের মধ্য দিয়ে যায়। আমার জন্য এরকম হয়েছিল যখন আমরা Startup Dhaka এর জন্য বিভিন্ন বিনিয়োগকারীদের থেকে তহবিল সংগ্রহ করছিলাম। আমরা অবাক হয়েছিলাম দেখে যে আমরা খুব শীঘ্রই চুক্তি টি সম্পূর্ণ করতে পেরেছিলাম। সেই মুহূর্তে আমাদের প্রতিষ্ঠান তেমন কোন মুনাফা অর্জন করছিলো না, কিন্তু বিনিয়োগকারীরা প্রতিষ্ঠাতাদের উপর আস্থা রেখেছিল যা পুরো টিম এর জন্য এক অসাধারণ প্রশংসাপত্র ছিল।"},
			{"যেকোন নতুন ব্যাবসায়িক প্রতিষ্ঠান এর ই ৮৫% ব্যর্থতার সম্ভাবনা থাকে। তাই ব্যাবসা করার সময় আমি এই হুমকি টি মাথায় রাখি। আমি ব্যক্তিগত ভাবে প্রতিযোগিতামূলক কোন কিছুতে মনোযোগ দেই যেটা সহজে নকল করা যাবেনা। আমি কাইজান নামক একটি জাপানি ব্যাবসায়িক মতাদর্শে বিশ্বাস করি, যেটা কোন পণ্য কে বারবার উন্নয়ন করাকে বোঝায়। আসলে এটাই একমাত্র উপায় যেভাবে কেউ প্রতিযোগীতায় এক ধাপ এগিয়ে থাকতে পারবে।  "},
			{"আমরা উদাহরণ ভিত্তিক কাজের মাধ্যমে ভালো কাজের সংস্কৃতি ধরে রাখি। আমরা সবসময় মানুষ কে কঠোর পরিশ্রমের মাধ্যমে সঠিক কাজ করার জন্য উ\u09CEসাহিত করি যেন আমাদের গ্রাহকেরা  আমাদের কাজকে ভালোবাসে।"},
			{"নিজের অনুভূতি কে অনুসরণ করা; এটা অতিরঞ্জিত শোনাতে পারে, কিন্তু আমারে ক্ষেত্রে কাজ করেছে।"},
			{"সম্প্রতি আমরা  ZuumZuum নামক একটি ফ্যাশন ও লাইফস্টাইল ভিত্তিক ই-কমার্স প্ল্যাটফর্ম শুরু করি যেটা এমন একটা ব্র্যান্ড হয়ে উঠবে যাকে ক্রেতারা ফ্যাশন সম্পর্কিত যেকোন বিষয়ে বিশ্বাস করতে পারবে। এটা ছোট ও বড় যেকোন লেবেল ও ডিজাইনার কে অনলাইন মার্কেটে সংযুক্ত করবে এবং যারা ব্র্যান্ডেড কাপড় ও অন্যান সামগ্রী চান তাদের কে ওয়ানস্টপ সমাধান প্রদান করবে। যেহেতু ZuumZuum এর মূল কথা হলো ফাস্ট ফ্যাশন, সেহেতু এই কাপড়গুলো সীমিত সময়ের জন্য বিপণী গুলোতে থাকবে, যতদিন তাদের ‘ট্রেন্ড’ আছে। এছাড়াও দ্রুত ও কার্যকরী ডেলিভারী দেয়ার জন্য The Startup এর নিজস্ব ওয়্যারহাউজ ও সাপ্লাই চেইন আছে। আমরা যারা ZuumZuum এ আছি তারা স্টাইল এর বিভিন্ন রকম সেন্স উদযাপনে বিশ্বাস করি। “Own Your Look”- মতবাদে একমত হয়ে ZuumZuum মনে করে যে ভিন্ন ভিন্ন মানুষের ফ্যাশন সম্পর্কে ভিন্নধর্মী অনুভূতি রয়েছে এবং তাদের নিজস্ব লুক প্রকাশের ব্যাপারে অণুপ্রেণিত করে ।"},
			{"আমার mac air ও আইফোন আমার খুব ই পছন্দের, কারণ তারা অসাধারণ কাজ করে। তাদের ডিজাইন গুলো নিখুঁত, ইন্টারফেস বেশ ইউজার ফ্রেইন্ডলি এবং নির্ভরতার ব্যাপারে তারা পাথর দৃঢ়। আমার প্রথম কম্পিউটার ছিল Macintosh যেটা কখনোই আমাকে নিরাশ করেনি।"},
			{"Google search – আমার প্রফেসর।\n" +
					"SD ASIA ওয়েবসাইট – যেটা আমাকে এশিয়া তে হচ্ছে এরকম সব টেক ও স্টার্টআপ এর সিক্সটি ওয়ার্ড সামারী দিয়ে থাকে।\n" +
					"Mail – এটা আমাকে কানেক্টেড থাকতে এবং ব্যবসায়িক কাজে সহায়তা করে।"},
			{"আমাদের অফিস ওয়েইভ নামের একটি কো-ওয়ারকিং স্পেস যেটা সত্যিই অসাধারণ। এটা কাজ করার জন্য একটি ভালো জায়গা কারণ এখানে ওপেন ডেস্ক,  ব্যাকগ্রাউন্ড এ গান, একটি গাছ এবং ব্যাক্তিগত কথা বলার জন্য একটি লাল টেলিফোন বুথ রয়েছে।"},
			{"আমার মিউজিকের টেস্ট অনেকটা ‘একলেক্টিক’ , কিন্তু কাজ করার সময় আমি দিনের বেলা ইলেক্ট্রনিক মিউজিক এবং বিকেলের দিকে ওয়েস্টার্ন ক্লাসিকাল শুনতে পছন্দ করি।"},
			{"আমি পড়ার সাথে ক্যাচ আপ করতে চেষ্টা করি বা সাথে ল্যাপটপ থাকলে কাজ করি।"},
			{"ল্যাপটপ এবং ফোন এর পর আমার তৃতীয় প্রিয়তম ডিভাইস হলো আমার iPad mini।"},
			{"খুব সকালে কিংবা রাতে, তাহলে আমি অমনোযোগ এড়িয়ে প্রোডাক্টিভ হতে পারি।"},
			{"আমার একটি ছোট মেয়ে আছে যে খুব সকালে স্কুলে যায়, তাই আমি মোটামুটি আগেই ঘুমাতে যাই।"},
			{"স্ট্যানফোর্ডের এর সমাবর্তন অনুষ্ঠানে  স্টিভ Jobs এর বক্তৃতা থেকে আমি সবচেয়ে অসাধারণ উপদেশ পেয়ে থাকে, এবং এটা সত্যই অমূল্য। আমার জীবনের অনেক সিদ্ধান্তই এর উপর ভিত্তি করে যা থেকে এখন অনেক কিছু বুঝতে পারি এবং আমি এখনো তাদের আমার মাঝে অনুসরণ করি।"},
			{"আমি যখন কোন চ্যালেঞ্জ এর সম্মুখীন হই তখন চেষ্টা করি কয়েকটি সমাধান বের করতে যা আমি অন্যদের সাথে আলোচনা করে তাদের মতামত জানতে পারবো। সমস্যা গুলো অন্যান্যদের মতামত অনুসারে সরিয়ে দেয়া গেলে অনেক ভালো কিছু আইডিয়া পাওয়া যায়।"},
			{"যদি কোন স্কিল এ আপনি পারদর্শী হতে চান তাহলে আপনাকে তাতে আরো সময় নিয়ে অনুশীলন করতে হবে। ব্যবসাও এর ব্যাতিক্রম নয়। ১৮ বছর ধরে কাজ করার মাধ্যমে আমি বিজিনেস ফান্ডামেন্টাল এর উপর বেশ কিছু শিখি, আর তাই এটা এখন আমার জন্য খুব সাধারণ ব্যাপার হয়ে উঠেছে।"},
			{"Steve Jobs – Apple এর প্রতিষ্ঠাতা।\n" +
					"Elon Musk – Tesla এর প্রতিষ্ঠাতা ও সিইও।\n" +
					"Peter Thiel – Paypal এর সহ প্রতিষ্ঠাতা এবং প্রাক্তন সিইও।\n" +
					"Latifur Rahman–Transcom Group এর চেয়ারম্যান এবং সিইও।"},
			{"উদ্যোক্তা হিসেবে আমি Startup Dhaka কে স্থানীয় ও আঞ্চলিক স্টার্টআপ স্পেস  গুলোর জন্য একটি প্রখ্যাত চিন্তাভাবনার নেতৃত্ব প্রদানকারী অবস্থায় দেখতে চাই। যদি আমাকে আরেকটু উচ্চাকাঙ্ক্ষী হতে বলা হয় তবে আমি ZuumZuum কে US $100 million কোম্পানী হিসেবে দেখতে চাই।"},
			{"ব্যবসায় উদ্যোগ ব্যপারটা সবার জন্য উপযুক্ত নয়, তাই আমি সবাইকে উপদেশ দিবো যেন চিন্তাভাবনা সাপেক্ষে এই পথটি বাছাই করে। এই পথের রাস্তা তে প্রায়ই অনেক বাধা থাকে যা কাজ এবং জীবনের ভারসম্য নষ্ট করে। যদি কারো কোন আইডিয়া থাকে তবে সবচেয়ে ভালো হয় যদি একটি ডেমো তৈরী করে সেই পণ্য বা সেবার চাহিদা আছে কিনা তা জেনে নেয়া যায়। ডেমো টা কে খুব বেশি নিখুঁত না করে বরং দ্রুত ক্রেতাদের কাছে পৌছে দিয়ে তাদের মতামতের ভিত্তিতে পরবর্তী তে তা উন্নত করা উচিত।"},
			{"রাফ মুস্তাফা।"}
	};

	public DetailsAdapter(Context context) {
		mContext = context;
		mLayoutInflater = (LayoutInflater) mContext.getSystemService(Context.LAYOUT_INFLATER_SERVICE);
	}
	
	@Override
	public int getGroupCount() {
		return mGroups.length;
	}

	@Override
	public Object getGroup(int groupPosition) {
		return mGroups[groupPosition];
	}

	@Override
	public long getGroupId(int groupPosition) {
		return groupPosition;
	}

	@Override
	public View getGroupView(int groupPosition, boolean isExpanded, View convertView, ViewGroup parent) {
		if(convertView == null) {
            convertView = mLayoutInflater.inflate(R.layout.details_activity_list_group_item, parent, false);
		}

	//	final ImageView image = (ImageView) convertView.findViewById(R.id.sample_activity_list_group_item_image);
	//	image.setImageResource(mGroupDrawables[groupPosition]);

		final TextView text = (TextView) convertView.findViewById(R.id.sample_activity_list_group_item_text);
		text.setText(mGroups[groupPosition]);
		
		//final ImageView expandedImage = (ImageView) convertView.findViewById(R.id.sample_activity_list_group_expanded_image);
		//final int resId = isExpanded ? R.drawable.minus : R.drawable.plus;
		//expandedImage.setImageResource(resId);

		return convertView;
	}

	@Override
	public int getChildrenCount(int groupPosition) {
		return mChilds[groupPosition].length;
	}

	@Override
	public Object getChild(int groupPosition, int childPosition) {
		return mChilds[groupPosition][childPosition];
	}

	@Override
	public long getChildId(int groupPosition, int childPosition) {
		return childPosition;
	}

	@Override
	public View getChildView(int groupPosition, int childPosition, boolean isLastChild, View convertView, ViewGroup parent) {
		if(convertView == null) {
			convertView = mLayoutInflater.inflate(R.layout.details_activity_list_child_item, parent, false);
		}
		
		final TextView text = (TextView) convertView.findViewById(R.id.sample_activity_list_child_item_text);
		text.setText(mChilds[groupPosition][childPosition]);
		
		return convertView;
	}

	@Override
	public boolean hasStableIds() {
		return false;
	}

	@Override
	public boolean isChildSelectable(int groupPosition, int childPosition) {
		return false;
	}

}
